# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Categories..::..ReverseIterator Method
Categories Class See Also
---
Retrieves a backward moving iterator to the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override CategoryNameMapIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overrides Function ReverseIterator As CategoryNameMapIterator
```

Visual C++
---
```text
public:
virtual CategoryNameMapIterator^ ReverseIterator() override
```

# ### Return Value
A backward moving iterator to the map.
# See Also
Categories Class
Autodesk.Revit.DB Namespace